backend/app/controllers/scores_controller.rb

SELECT "scores".* FROM "scores"
---
    def index
        scores = Score.all

SELECT "scores".* FROM "scores" WHERE "scores"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def show
        score = Score.find_by_id(params[:id])

SELECT "users".* FROM "users" WHERE "users"."name" = ? LIMIT ?  [["name", "Aurel"], ["LIMIT", 1]]
SELECT "users".* FROM "users" ORDER BY "users"."id" DESC LIMIT ?  [["LIMIT", 1]]
INSERT INTO "users" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "no name"], ["created_at", "2021-02-08 22:07:16.106076"], ["updated_at", "2021-02-08 22:07:16.106076"]]
INSERT INTO "scores" ("wins", "loses", "draws", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["wins", 1], ["loses", 0], ["draws", 0], ["user_id", 59], ["created_at", "2021-02-10 21:26:19.504215"], ["updated_at", "2021-02-10 21:26:19.504215"]]
INSERT INTO "games" ("win", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["win", "1"], ["user_id", 59], ["created_at", "2021-02-10 21:26:19.523604"], ["updated_at", "2021-02-10 21:26:19.523604"]]
SELECT COUNT(*) FROM "scores" WHERE "scores"."user_id" = ? AND "scores"."wins" = ?  [["user_id", 59], ["wins", 1]]
SELECT COUNT(*) FROM "scores" WHERE "scores"."user_id" = ? AND "scores"."loses" = ?  [["user_id", 59], ["loses", 1]]
SELECT COUNT(*) FROM "scores" WHERE "scores"."user_id" = ? AND "scores"."draws" = ?  [["user_id", 59], ["draws", 1]]
SELECT COUNT(*) FROM "games" WHERE "games"."user_id" = ?  [["user_id", 59]]
---
    def create
      user   = User.find_by_name(params[:username])
      if params[:status].split("<span>")[1].present?
        lose = 1
      else
        win    = params[:status] == '× has won!' ?  1 : 0
        lose   = 0
        draw   = params[:status] == 'Game is tied!' ? 1 : 0
      end
      if !user.present?
        user = User.create(name: 'no name')
      end

    #   Updating the users score board
      user.scores.create(wins: win, loses: lose, draws: draw)
      user.games.create(win: win)
      total_wins = user.scores.where(wins: 1).count
      total_loses = user.scores.where(loses: 1).count
      total_draw = user.scores.where(draws: 1).count
      render json: {name: user.name, total_draw: total_draw, total_loses: total_loses, total_wins: total_wins, total_games: user.games.count }