backend/app/controllers/users_controller.rb

    def create
      if params[:username].length > 0
          user = User.find_or_create_by(name: params[:username])
      else
          user = User.create(name: "no name")
      end
    #   Reteriving users games information from database
      total_wins = user.scores.where(wins: 1).count
      total_loses = user.scores.where(loses: 1).count
      total_draw = user.scores.where(draws: 1).count
      render json: {name: user.name, total_draw: total_draw, total_loses: total_loses, total_wins: total_wins, total_games: user.games.count }
---
INSERT INTO "users" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "aas"], ["created_at", "2021-02-08 19:47:30.466206"], ["updated_at", "2021-02-08 19:47:30.466206"]]
SELECT "users".* FROM "users" WHERE "users"."name" = ? LIMIT ?  [["name", "arslan"], ["LIMIT", 1]]
SELECT COUNT(*) FROM "scores" WHERE "scores"."user_id" = ? AND "scores"."wins" = ?  [["user_id", 26], ["wins", 1]]
SELECT COUNT(*) FROM "scores" WHERE "scores"."user_id" = ? AND "scores"."loses" = ?  [["user_id", 26], ["loses", 1]]
SELECT COUNT(*) FROM "scores" WHERE "scores"."user_id" = ? AND "scores"."draws" = ?  [["user_id", 26], ["draws", 1]]
SELECT COUNT(*) FROM "games" WHERE "games"."user_id" = ?  [["user_id", 26]]

    def update
      user = User.find_by_name(params[:username])
      if user.update(name: params[:new_name])
        total_wins = user.scores.where(wins: 1).count
        total_loses = user.scores.where(loses: 1).count
        total_draw = user.scores.where(draws: 1).count
        render json: {name: user.name, total_draw: total_draw, total_loses: total_loses, total_wins: total_wins, total_games: user.games.count }
---
SELECT "users".* FROM "users" WHERE "users"."name" = ? LIMIT ?  [["name", "player name :no name"], ["LIMIT", 1]]
UPDATE "users" SET "name" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "chand"], ["updated_at", "2021-02-08 22:12:47.648915"], ["id", 4]]
SELECT COUNT(*) FROM "scores" WHERE "scores"."user_id" = ? AND "scores"."wins" = ?  [["user_id", 4], ["wins", 1]]
SELECT COUNT(*) FROM "scores" WHERE "scores"."user_id" = ? AND "scores"."loses" = ?  [["user_id", 4], ["loses", 1]]
SELECT COUNT(*) FROM "scores" WHERE "scores"."user_id" = ? AND "scores"."draws" = ?  [["user_id", 4], ["draws", 1]]
SELECT COUNT(*) FROM "games" WHERE "games"."user_id" = ?  [["user_id", 4]]

    def destroy
        user = User.find_by_name(params[:username])
        r = user.destroy
---
SELECT "users".* FROM "users" WHERE "users"."name" = ? LIMIT ?  [["name", "a"], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 44]]